
<?php
//решение задачи 1
$n = 100;
$i = 0;
while($i <= $n){
    if( $i%3 === 0 ){ 
        echo $i . ", ";
    } 
    $i++;
}
?>

<?="<hr/>"?>

<?php
//решение задачи 2
$n = 10;
$i = 0;
do{
    if($i === 0){ echo "$i - это ноль" . "<br/>"; }
    elseif($i%2 === 0){ echo "$i - это чётное число" . "<br/>"; }
    else{ echo "$i - это нечётное число" . "<br/>"; } 
    $i++;
}while($i <= $n);
?>

<?="<hr/>"?>

<?php
//решение задачи 3
$map =  [
    "Московская область" => ["Москва","Зеленоград,","Клин"],
    "Ленинградская область"  => ["Санкт-Петербург", "Всеволожск", "Пушкин", "Павловск"],
    "Краснодарский край" => ["Краснодар", "Сочи", "Новороссийск", "Анапа"]
];

foreach($map as $area => $cities){
    echo "$area :" . "<br/>";
    $cts = implode(' , ', $cities);
    echo "$cts" . "<br/>";
}
?>

<?="<hr/>"?>

<?php
//решение задачи 4
function getTranslitArray(){
    return [
        "а" => "a",
        "б" => "b",
        "в" => "v",
        "г" => "g",
        "д" => "d",
        "е" => "e",
        "ё" => "yo",
        "ж" => "zh",
        "з" => "z",
        "и" => "i",
        "й" => "y",
        "к" => "k",
        "л" => "l",
        "м" => "m",
        "н" => "n",
        "о" => "o",
        "п" => "p",
        "р" => "r",
        "с" => "s",
        "т" => "t",
        "у" => "u",
        "ф" => "f",
        "х" => "h",
        "ц" => "ts",
        "ч" => "ch",
        "ш" => "sh",
        "щ" => "s'h",
        "ъ" => "",
        "ы" => "i",
        "ь" => "'",
        "э" => "e",
        "ю" => "yu",
        "я" => "ya",
        " " => "_"
    ];
}

function transpilation($str){
    return strtr(mb_strtolower($str), getTranslitArray() );
}

echo transpilation("Домашние задание по PHP");

?>

<?="<hr/>"?>

<?php
//решение задачи 5
function changeSpace($str){
    return strtr($str, ' ', '_');
}

echo changeSpace("Домашние задание по PHP");

?>

<?="<hr/>"?>

<?php
//решение задачи 7
for($i=0; $i<=9; print($i++ ." , ")){}
?>

<?="<hr/>"?>

<?php
//решение задачи 8
$map =  [
    "Московская область" => ["Москва","Зеленоград,","Клин"],
    "Ленинградская область"  => ["Санкт-Петербург", "Всеволожск", "Пушкин", "Павловск"],
    "Краснодарский край" => ["Краснодар", "Сочи", "Новороссийск", "Анапа"]
];

foreach($map as $area => $cities){
    $citiesNameK = [];
    foreach($cities as $city){
        if(mb_substr($city, 0, 1) === "К"){
            $citiesNameK[] = $city; 
        }
    }
    $ctsK = implode(' , ', $citiesNameK);
    echo "$area :" . "<br/>";
    echo "$ctsK" . "<br/>";
}
?>

<?="<hr/>"?>

<?php
//решение задачи 9
echo transpilation(changeSpace("Домашние задание по PHP"));

?>